{
  "blog_category": "NYC Attractions and Events",
  "title_localized": {
    "en": "Always Fresh, Always Bold: New York Fashion Week 2018"
  },
  "meta_description_localized": {
    "en": "Fabulously Styled & Classically Designed, New York Fashion Week 2018 Delights In Taking Over The City "
  },
  "url_friendly_name_localized": {
    "en": "always-fresh-always-bold-new-york-fashion-week"
  },
  "date": "2018-08-29T18:30:00.000Z",
  "post_content_localized": {
    "en": "<p><strong>Fabulously Styled &amp; Classically Designed, New York Fashion Week 2018 Delights In Taking Over The City&nbsp;</strong></p>\n<p>Just as foodies have Restaurant Week, fashionistas have <a title=\"New York Fashion Week\" href=\"http://nyfw.com/\" target=\"_blank\" rel=\"noopener noreferrer\">New York Fashion Week</a>. For months now, we have been waiting as designers carefully curate the finishing touches to their runway shows, and from Thursday, September 6 to Friday, September 14, this stylish takeover will finally descend upon us with excitement and all kinds of unexpected fabulousness.</p>\n<p><a title=\"Fashion Week \" href=\"https://www.vogue.com/article/new-york-fashion-week-spring-2019-schedule\" target=\"_blank\" rel=\"noopener noreferrer\">Fashion Week </a>is truly about experiencing the buzz throughout the city rather than attending just one event. While many of the highly-anticipated fashion shows are by invitation only, that doesn&rsquo;t matter because the streets of New York will be overflowing with colorful photo-ops and random flashes of beauty.</p>\n<p>Already, the thrill of wandering the city streets promises a host of unique discoveries, and during Fashion Week you can expect your explorations to take on an even more dazzlingly, design dynamic. Many of the best shops around the city are offering wonderful sales, free events and parties that celebrate the world of fashion and beauty, and Model and celebrity sightings will become an everyday occurrence (even more than normal). New Yorkers love a challenge and many of them will find themselves amping up their style game and dressing to the nines just to keep up.</p>\n<p><strong>Yet for loyal, fierce Fashion Week fashionistas&hellip;</strong></p>\n<p>Fear not! All of your favorite mainstays will be on hand to assert their runway royalty status. From Michael Kors and Ralph Lauren to Tory Burch and Oscar de la Renta, expect these heavy-hitters to bring their stylish A-game to the Spring 2019 slate of fashions. Just as exciting is the much-anticipated return of Vivienne Westwood, and the arrival of newcomers Rodarte and Kozaburo Akasaka - both coming off successful pre-NYFW campaigns to earn a coveted spot on the schedule.</p>\n<p>Making your way to the city for the most stylish week on NYC&rsquo;s calendar of events? Book a suite with us at The Manhattan Club. Located in the heart of the action in Midtown, our luxurious, yet comfortable accommodations are beautifully designed to make you feel right at home.</p>"
  },
  "image": {
    "name": "New York Fashion Week 2018",
    "content_type": "image/jpeg",
    "date_added": "2019-03-14-060321",
    "url_thumb": "//res.cloudinary.com/traveltripperweb/image/upload/c_fill,g_faces,h_140,w_140/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "url_xsmall": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_300,w_300/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "url_small": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_768,w_768/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "url_medium": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_992,w_992/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "url_large": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_1200,w_1200/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "url_xlarge": "//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_1920,w_1920/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "width": 320,
    "height": 480,
    "format": "jpg",
    "url": "//res.cloudinary.com/traveltripperweb/image/upload/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "resource_type": "image",
    "size": 154935,
    "path": "//res.cloudinary.com/traveltripperweb/image/upload/v1552557801/vvvolbvgux6fawzniq9o.jpg",
    "file_size": null,
    "alt": "New York Fashion Week 2018",
    "caption": "",
    "description": ""
  }
}